Revit 2026 API

# FitDirectionType Enumeration

---

This enum is used to define the direction to fit the number of pixels defined by PixelSize.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FitDirectionType
```
```vb
Public Enumeration FitDirectionType
```
```cpp
public enum class FitDirectionType
```
```fsharp
type FitDirectionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Horizontal | 0 | Fit a specific number of pixels in horizontal direction. |
| Vertical | 1 | Fit a specific number of pixels in vertical direction. |

#### Reference

Autodesk.Revit.DB Namespace